  
  Процедура ДополнитьФорму(Форма) Экспорт 
	  
	  ИмяФормы = Форма.ИмяФормы;
	  
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		  
		  ДоработатьФормуЗаказа(Форма);
		  
	  ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  
		  
		  ДоработатьФормуПродажаПокупка(Форма);
		  	  
	  
  ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	  
	  ПолеКонтактноеЛицо = Форма.Элементы.Вставить("ПС_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	  ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ПС_КонтактноеЛицо";
	  НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	  МассивСвязей = Новый Массив();
	  МассивСвязей.Добавить(НоваяСвязь);
	  НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
	  ПолеКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
	  
  КонецЕсли;
  
КонецПроцедуры

Процедура ДоработатьФормуЗаказа(Форма)
    
  ПолеКонтактноеЛицо = Форма.Элементы.Добавить("ПС_КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
  ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
  ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ПС_КонтактноеЛицо";
  НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
  МассивСвязей = Новый Массив();
  МассивСвязей.Добавить(НоваяСвязь);
  НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
  ПолеКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
  
  ПолеСкидка = Форма.Элементы.Добавить("ПС_Скидка", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
  ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
  ПолеСкидка.ПутьКДанным = "Объект.ПС_Скидка";
  ПолеСкидка.УстановитьДействие("ПриИзменении", "ПС_СкидкаПриИзменении"); 
  
  Команда = Форма.Команды.Добавить("ПС_Пересчитать");
  Команда.Заголовок = ("Пересчитать");
  Команда.Действие = "ПС_Пересчитать";
  
  КнопкаФормы = Форма.Элементы.Добавить("КнопкаПересчитать", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
  КнопкаФормы.ИмяКоманды = "ПС_Пересчитать";
  КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;


КонецПроцедуры 

Процедура ДоработатьФормуПродажаПокупка(Форма)
  
  ПолеКонтактноеЛицо = Форма.Элементы.Добавить("ПС_КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
  ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
  ПолеКонтактноеЛицо.ПутьКДанным = "Объект.ПС_КонтактноеЛицо";
  НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
  МассивСвязей = Новый Массив();
  МассивСвязей.Добавить(НоваяСвязь);
  НовыеСвязи = Новый ФиксированныйМассив(МассивСвязей);
  ПолеКонтактноеЛицо.СвязиПараметровВыбора = НовыеСвязи;
  
КонецПроцедуры


